20230610121558-garbanzo.org
:PROPERTIES:
:ID:       251a3a5b-2c98-453f-a680-4bf79b16ea22
:mtime:    20241102180349 20241028101410
:ctime:    20230610121558
:END:
#+title: garbanzo

* 概要
garbanzoは通知ビューワを自作するプロジェクト。

[[https://efcl.info/2014/0430/res3872/][Githubのタイムラインや通知を見るアプリをnode-webkitで作った | Web Scratch]]的なことをやりたい。

* Memo
** 制約
- iframe内で他ホストの絶対リンクを開けない
  - ブラウザの制約のため
- iframe内で相対リンクを開けない
  - リンクは暗黙的に、プロキシサーバがホストになる。つまりlocalhost。そうすると元のホストが消えるため、辿れない
* Tasks
** TODO 受け取れる環境変数の一覧を表示できるようにする
READMEに書いておくのだと忘れるし面倒なので、コマンドで一覧表示できるとよい。
** TODO オフラインにすると止まる
サーバごと止まる。取得できないとキャンセルしないといけない。
** TODO 2回既読リストに入る可能性がある
チェックをするか、重複を許さないようにハッシュに読み込むなどする。
** TODO サイドバーを可変にする
:LOGBOOK:
CLOCK: [2023-06-18 Sun 17:37]--[2023-06-18 Sun 18:02] =>  0:25
CLOCK: [2023-06-18 Sun 17:04]--[2023-06-18 Sun 17:29] =>  0:25
:END:
ページによって横幅でデザイン崩れが発生する。例えばdev community。
** TODO 既読エンドポイントを普通のエンドポイントにする
クライアント→サーバをwebsocketでやってるけど、別にそうでなくていい。
** TODO コピペ用にiframe内のリンクを表示する
どこにいるかわかりにくいというのもある。カンタンだけど、表示する場所がないな。
** TODO カテゴリの色を設定できるようにする
よりわかりやすくする。
** TODO デスクトップUIを作成する
:LOGBOOK:
CLOCK: [2023-06-12 Mon 23:19]--[2023-06-12 Mon 23:44] =>  0:25
CLOCK: [2023-06-10 Sat 15:13]--[2023-06-10 Sat 15:38] =>  0:25
CLOCK: [2023-06-10 Sat 14:25]--[2023-06-10 Sat 14:50] =>  0:25
CLOCK: [2023-06-10 Sat 13:32]--[2023-06-10 Sat 13:57] =>  0:25
CLOCK: [2023-06-10 Sat 12:52]--[2023-06-10 Sat 13:17] =>  0:25
CLOCK: [2023-06-10 Sat 12:18]--[2023-06-10 Sat 12:43] =>  0:25
:END:

- iframeだと制約が大きい
  - リンクが辿れない
  - ホストを変えられない

ただ、iframe制約を回避するためのプロキシによってキャッシュを保持し、高速遷移できている側面もある。

- feed遷移と、あとでリンクを辿るのを区別する必要がある。feed遷移したあとにホストがプロキシサーバにならなければいい。読み込んだあとに変えることはできそうな
- つまり、iframe制約を超えられれば可能性がある

** TODO リポジトリごとに分けて表示できるようにする
一見同じなので混ざって読みにくい。

jQueryだけだと厳しいか。

** TODO キャッシュを更新できるようにする
iframe内の更新ボタンみたいなのを作成する。キャッシュ時刻を保持してもよさそう。
** TODO iframeでGitHub以外も開きたい
:LOGBOOK:
CLOCK: [2023-06-06 Tue 23:05]--[2023-06-06 Tue 23:30] =>  0:25
CLOCK: [2023-06-06 Tue 22:38]--[2023-06-06 Tue 23:03] =>  0:25
:END:
ちょっとしたときに、不便。見てる途中で開きたいことはけっこうある。

ブラウザでやる限り厳しい可能性が高い。デスクトップアプリにするか、ブラウザを埋め込むか。
** TODO 実行チェックのCIを追加する
5分くらい立ち上げるだけのチェック。ないよりはマシか。
* Reference
* Archives
** DONE オフラインになっても止まらないようにする
CLOSED: [2023-06-10 Sat 10:32]
今はフェッチに失敗すると止まる。別にサーバに影響を与えなくていい。

timeout cancelさせればいいのか。
** CLOSE 直近にクリックした項目を色をつける
CLOSED: [2023-06-06 Tue 01:27]

どこまでたどったかわからなくなるので。削除したときに最新の画面を開くなったので、別にいらなくなった。
** DONE 開いたときのiframe内に表示するページとして、Garbanzoの静的ページを用意する
CLOSED: [2023-06-06 Tue 01:26]
:LOGBOOK:
CLOCK: [2023-06-05 Mon 23:08]--[2023-06-05 Mon 23:33] =>  0:25
CLOCK: [2023-06-05 Mon 08:19]--[2023-06-05 Mon 08:45] =>  0:26
:END:
ツールのウェルカムページとしていい感じのページにする。
** DONE 削除したとき、先頭の項目でiframeを切り替えたい
CLOSED: [2023-06-06 Tue 01:26]
:LOGBOOK:
CLOCK: [2023-06-06 Tue 00:26]--[2023-06-06 Tue 00:51] =>  0:25
CLOCK: [2023-06-06 Tue 00:01]--[2023-06-06 Tue 00:26] =>  0:25
:END:
そのままチェックボタンを押すだけで、次のやつを見たい。
** DONE 既読にできるようにする
CLOSED: [2023-06-05 Mon 08:21]
:LOGBOOK:
CLOCK: [2023-06-05 Mon 00:11]--[2023-06-05 Mon 00:36] =>  0:25
CLOCK: [2023-06-04 Sun 23:45]--[2023-06-05 Mon 00:10] =>  0:25
CLOCK: [2023-06-04 Sun 23:14]--[2023-06-04 Sun 23:39] =>  0:25
CLOCK: [2023-06-04 Sun 22:49]--[2023-06-04 Sun 23:14] =>  0:25
CLOCK: [2023-06-04 Sun 22:22]--[2023-06-04 Sun 22:47] =>  0:25
CLOCK: [2023-06-04 Sun 11:27]--[2023-06-04 Sun 11:52] =>  0:25
:END:
表示やデータからの削除と、既読リクエストをやる。

受け渡しがうまくいかない。chanに送信はできるのだが、受信できてないよう。chanを初期化してないせいだった。
** DONE 長い本文は省略する
CLOSED: [2023-06-04 Sun 02:03]
:LOGBOOK:
CLOCK: [2023-06-04 Sun 01:32]--[2023-06-04 Sun 01:57] =>  0:25
:END:
どうせサイドバーだけから見ることはない。でもmarkdownからHTMLに変換をかけてるから切り出すのは難しそうな。
本文非表示でいいか。
** DONE 通知のアイコンや文章を調整する
CLOSED: [2023-06-04 Sun 02:03]
いい感じにする。
** CLOSE issueイベントにはオープンの場合とクローズの場合がある
CLOSED: [2023-06-04 Sun 02:03]
区別はできないようだ。
** DONE DiscussionとReleaseイベントに対応する
CLOSED: [2023-06-04 Sun 01:19]
:LOGBOOK:
CLOCK: [2023-06-04 Sun 01:02]--[2023-06-04 Sun 01:19] =>  0:17
CLOCK: [2023-06-03 Sat 23:34]--[2023-06-03 Sat 23:59] =>  0:25
CLOCK: [2023-06-03 Sat 23:03]--[2023-06-03 Sat 23:28] =>  0:25
:END:
対応できてない。

discussionは、APIの不具合でURLが取れないので不可能。スルーする。
** DONE PRオープンの通知が来てない
CLOSED: [2023-06-04 Sun 02:02]
:LOGBOOK:
CLOCK: [2023-06-03 Sat 22:38]--[2023-06-03 Sat 23:03] =>  0:25
CLOCK: [2023-06-03 Sat 22:13]--[2023-06-03 Sat 22:38] =>  0:25
:END:

PRイベントをスルーしてたので直した。
** DONE デスクトップ通知
CLOSED: [2023-06-03 Sat 22:15]
:LOGBOOK:
CLOCK: [2023-06-03 Sat 21:44]--[2023-06-03 Sat 22:09] =>  0:25
CLOCK: [2023-06-03 Sat 19:44]--[2023-06-03 Sat 20:09] =>  0:25
CLOCK: [2023-06-03 Sat 19:19]--[2023-06-03 Sat 19:44] =>  0:25
CLOCK: [2023-06-03 Sat 18:54]--[2023-06-03 Sat 19:19] =>  0:25
:END:
push.jsでやればよいというが。

簡単にできた。ただ初回実行で通知が多すぎるので無視したい。

- 通知したいかどうかはクライアントによって変わる。最新のリロードしたてのクライアントでは通知は出ないが、開きっぱなしにしていたクライアントでは出る
- 初回読み込みからそれ以後に受信された場合は通知したい
- 初回リロード時は通知しない
- 最初にサーバを立ち上げたときは、徐々に追加していくので、初回リロードのロジックだけでは不足する
- 単純に更新が3分以内だったら、とかでもよさそうな
** DONE 上から新しい順に並ばせる
CLOSED: [2023-06-03 Sat 18:54]
:LOGBOOK:
CLOCK: [2023-06-03 Sat 18:19]--[2023-06-03 Sat 18:44] =>  0:25
CLOCK: [2023-06-03 Sat 17:47]--[2023-06-03 Sat 18:12] =>  0:25
CLOCK: [2023-06-03 Sat 17:13]--[2023-06-03 Sat 17:38] =>  0:25
:END:
今はmapから取り出してランダムで見にくい。

map型のroom.eventsで一覧を持っている。これはかぶりを防ぐためmap型にしている。eventsから、各クライアントのdoneにないものをwebsocketに書き込む。
** DONE commentとissue openの処理を共通化する
CLOSED: [2023-06-03 Sat 15:41]
:LOGBOOK:
CLOCK: [2023-06-03 Sat 15:36]--[2023-06-03 Sat 15:41] =>  0:05
CLOCK: [2023-06-03 Sat 15:10]--[2023-06-03 Sat 15:35] =>  0:25
:END:
できるところが多くある。
** DONE eventにタイプフィールドを追加する
CLOSED: [2023-06-03 Sat 12:03]
パッと見でわかりやすい。
:LOGBOOK:
CLOCK: [2023-06-03 Sat 11:11]--[2023-06-03 Sat 11:36] =>  0:25
:END:

タイプというか、タグ的な使い方か。
