20230610121558-garbanzo.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-06 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>garbanzo</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">garbanzo</h1>
<div id="outline-container-org88313a8" class="outline-2">
<h2 id="org88313a8"><a href="#org88313a8">概要</a></h2>
<div class="outline-text-2" id="text-org88313a8">
<p>
garbanzoは通知ビューワを自作するプロジェクト。
</p>

<p>
<a href="https://efcl.info/2014/0430/res3872/">Githubのタイムラインや通知を見るアプリをnode-webkitで作った | Web Scratch</a>的なことをやりたい。
</p>
</div>
</div>
<div id="outline-container-org6f13623" class="outline-2">
<h2 id="org6f13623"><a href="#org6f13623">Memo</a></h2>
<div class="outline-text-2" id="text-org6f13623">
</div>
<div id="outline-container-org0bfa206" class="outline-3">
<h3 id="org0bfa206"><a href="#org0bfa206">制約</a></h3>
<div class="outline-text-3" id="text-org0bfa206">
<ul class="org-ul">
<li>iframe内で他ホストの絶対リンクを開けない
<ul class="org-ul">
<li>ブラウザの制約のため</li>
</ul></li>
<li>iframe内で相対リンクを開けない
<ul class="org-ul">
<li>リンクは暗黙的に、プロキシサーバがホストになる。つまりlocalhost。そうすると元のホストが消えるため、辿れない</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb89e9db" class="outline-2">
<h2 id="orgb89e9db"><a href="#orgb89e9db">Tasks</a></h2>
<div class="outline-text-2" id="text-orgb89e9db">
</div>
<div id="outline-container-org63f30bc" class="outline-3">
<h3 id="org63f30bc"><a href="#org63f30bc"><span class="todo TODO">TODO</span> 受け取れる環境変数の一覧を表示できるようにする</a></h3>
<div class="outline-text-3" id="text-org63f30bc">
<p>
READMEに書いておくのだと忘れるし面倒なので、コマンドで一覧表示できるとよい。
</p>
</div>
</div>
<div id="outline-container-org509d98e" class="outline-3">
<h3 id="org509d98e"><a href="#org509d98e"><span class="todo TODO">TODO</span> オフラインにすると止まる</a></h3>
<div class="outline-text-3" id="text-org509d98e">
<p>
サーバごと止まる。取得できないとキャンセルしないといけない。
</p>
</div>
</div>
<div id="outline-container-org345c25f" class="outline-3">
<h3 id="org345c25f"><a href="#org345c25f"><span class="todo TODO">TODO</span> 2回既読リストに入る可能性がある</a></h3>
<div class="outline-text-3" id="text-org345c25f">
<p>
チェックをするか、重複を許さないようにハッシュに読み込むなどする。
</p>
</div>
</div>
<div id="outline-container-org5d91495" class="outline-3">
<h3 id="org5d91495"><a href="#org5d91495"><span class="todo TODO">TODO</span> サイドバーを可変にする</a></h3>
<div class="outline-text-3" id="text-org5d91495">
<p>
ページによって横幅でデザイン崩れが発生する。例えばdev community。
</p>
</div>
</div>
<div id="outline-container-orga935f4d" class="outline-3">
<h3 id="orga935f4d"><a href="#orga935f4d"><span class="todo TODO">TODO</span> 既読エンドポイントを普通のエンドポイントにする</a></h3>
<div class="outline-text-3" id="text-orga935f4d">
<p>
クライアント→サーバをwebsocketでやってるけど、別にそうでなくていい。
</p>
</div>
</div>
<div id="outline-container-org7889ff8" class="outline-3">
<h3 id="org7889ff8"><a href="#org7889ff8"><span class="todo TODO">TODO</span> コピペ用にiframe内のリンクを表示する</a></h3>
<div class="outline-text-3" id="text-org7889ff8">
<p>
どこにいるかわかりにくいというのもある。カンタンだけど、表示する場所がないな。
</p>
</div>
</div>
<div id="outline-container-org67596c4" class="outline-3">
<h3 id="org67596c4"><a href="#org67596c4"><span class="todo TODO">TODO</span> カテゴリの色を設定できるようにする</a></h3>
<div class="outline-text-3" id="text-org67596c4">
<p>
よりわかりやすくする。
</p>
</div>
</div>
<div id="outline-container-org95b989c" class="outline-3">
<h3 id="org95b989c"><a href="#org95b989c"><span class="todo TODO">TODO</span> デスクトップUIを作成する</a></h3>
<div class="outline-text-3" id="text-org95b989c">
<ul class="org-ul">
<li>iframeだと制約が大きい
<ul class="org-ul">
<li>リンクが辿れない</li>
<li>ホストを変えられない</li>
</ul></li>
</ul>

<p>
ただ、iframe制約を回避するためのプロキシによってキャッシュを保持し、高速遷移できている側面もある。
</p>

<ul class="org-ul">
<li>feed遷移と、あとでリンクを辿るのを区別する必要がある。feed遷移したあとにホストがプロキシサーバにならなければいい。読み込んだあとに変えることはできそうな</li>
<li>つまり、iframe制約を超えられれば可能性がある</li>
</ul>
</div>
</div>

<div id="outline-container-orgd9b6dc5" class="outline-3">
<h3 id="orgd9b6dc5"><a href="#orgd9b6dc5"><span class="todo TODO">TODO</span> リポジトリごとに分けて表示できるようにする</a></h3>
<div class="outline-text-3" id="text-orgd9b6dc5">
<p>
一見同じなので混ざって読みにくい。
</p>

<p>
jQueryだけだと厳しいか。
</p>
</div>
</div>

<div id="outline-container-orgd75c952" class="outline-3">
<h3 id="orgd75c952"><a href="#orgd75c952"><span class="todo TODO">TODO</span> キャッシュを更新できるようにする</a></h3>
<div class="outline-text-3" id="text-orgd75c952">
<p>
iframe内の更新ボタンみたいなのを作成する。キャッシュ時刻を保持してもよさそう。
</p>
</div>
</div>
<div id="outline-container-org69c7e63" class="outline-3">
<h3 id="org69c7e63"><a href="#org69c7e63"><span class="todo TODO">TODO</span> iframeでGitHub以外も開きたい</a></h3>
<div class="outline-text-3" id="text-org69c7e63">
<p>
ちょっとしたときに、不便。見てる途中で開きたいことはけっこうある。
</p>

<p>
ブラウザでやる限り厳しい可能性が高い。デスクトップアプリにするか、ブラウザを埋め込むか。
</p>
</div>
</div>
<div id="outline-container-orgc4b2eb5" class="outline-3">
<h3 id="orgc4b2eb5"><a href="#orgc4b2eb5"><span class="todo TODO">TODO</span> 実行チェックのCIを追加する</a></h3>
<div class="outline-text-3" id="text-orgc4b2eb5">
<p>
5分くらい立ち上げるだけのチェック。ないよりはマシか。
</p>
</div>
</div>
</div>
<div id="outline-container-org19f8d95" class="outline-2">
<h2 id="org19f8d95"><a href="#org19f8d95">Reference</a></h2>
</div>
<div id="outline-container-org5a3a573" class="outline-2">
<h2 id="org5a3a573"><a href="#org5a3a573">Archives</a></h2>
<div class="outline-text-2" id="text-org5a3a573">
</div>
<div id="outline-container-orgac079e1" class="outline-3">
<h3 id="orgac079e1"><a href="#orgac079e1"><span class="done DONE">DONE</span> オフラインになっても止まらないようにする</a></h3>
<div class="outline-text-3" id="text-orgac079e1">
<p>
今はフェッチに失敗すると止まる。別にサーバに影響を与えなくていい。
</p>

<p>
timeout cancelさせればいいのか。
</p>
</div>
</div>
<div id="outline-container-orgd04b2f5" class="outline-3">
<h3 id="orgd04b2f5"><a href="#orgd04b2f5"><span class="done CLOSE">CLOSE</span> 直近にクリックした項目を色をつける</a></h3>
<div class="outline-text-3" id="text-orgd04b2f5">
<p>
どこまでたどったかわからなくなるので。削除したときに最新の画面を開くなったので、別にいらなくなった。
</p>
</div>
</div>
<div id="outline-container-org713d9d3" class="outline-3">
<h3 id="org713d9d3"><a href="#org713d9d3"><span class="done DONE">DONE</span> 開いたときのiframe内に表示するページとして、Garbanzoの静的ページを用意する</a></h3>
<div class="outline-text-3" id="text-org713d9d3">
<p>
ツールのウェルカムページとしていい感じのページにする。
</p>
</div>
</div>
<div id="outline-container-org599e2a0" class="outline-3">
<h3 id="org599e2a0"><a href="#org599e2a0"><span class="done DONE">DONE</span> 削除したとき、先頭の項目でiframeを切り替えたい</a></h3>
<div class="outline-text-3" id="text-org599e2a0">
<p>
そのままチェックボタンを押すだけで、次のやつを見たい。
</p>
</div>
</div>
<div id="outline-container-org9bd3a2a" class="outline-3">
<h3 id="org9bd3a2a"><a href="#org9bd3a2a"><span class="done DONE">DONE</span> 既読にできるようにする</a></h3>
<div class="outline-text-3" id="text-org9bd3a2a">
<p>
表示やデータからの削除と、既読リクエストをやる。
</p>

<p>
受け渡しがうまくいかない。chanに送信はできるのだが、受信できてないよう。chanを初期化してないせいだった。
</p>
</div>
</div>
<div id="outline-container-org5f56500" class="outline-3">
<h3 id="org5f56500"><a href="#org5f56500"><span class="done DONE">DONE</span> 長い本文は省略する</a></h3>
<div class="outline-text-3" id="text-org5f56500">
<p>
どうせサイドバーだけから見ることはない。でもmarkdownからHTMLに変換をかけてるから切り出すのは難しそうな。
本文非表示でいいか。
</p>
</div>
</div>
<div id="outline-container-org91ba5e0" class="outline-3">
<h3 id="org91ba5e0"><a href="#org91ba5e0"><span class="done DONE">DONE</span> 通知のアイコンや文章を調整する</a></h3>
<div class="outline-text-3" id="text-org91ba5e0">
<p>
いい感じにする。
</p>
</div>
</div>
<div id="outline-container-orgca604cb" class="outline-3">
<h3 id="orgca604cb"><a href="#orgca604cb"><span class="done CLOSE">CLOSE</span> issueイベントにはオープンの場合とクローズの場合がある</a></h3>
<div class="outline-text-3" id="text-orgca604cb">
<p>
区別はできないようだ。
</p>
</div>
</div>
<div id="outline-container-org3f91330" class="outline-3">
<h3 id="org3f91330"><a href="#org3f91330"><span class="done DONE">DONE</span> DiscussionとReleaseイベントに対応する</a></h3>
<div class="outline-text-3" id="text-org3f91330">
<p>
対応できてない。
</p>

<p>
discussionは、APIの不具合でURLが取れないので不可能。スルーする。
</p>
</div>
</div>
<div id="outline-container-org162d3ae" class="outline-3">
<h3 id="org162d3ae"><a href="#org162d3ae"><span class="done DONE">DONE</span> PRオープンの通知が来てない</a></h3>
<div class="outline-text-3" id="text-org162d3ae">
<p>
PRイベントをスルーしてたので直した。
</p>
</div>
</div>
<div id="outline-container-org08963e5" class="outline-3">
<h3 id="org08963e5"><a href="#org08963e5"><span class="done DONE">DONE</span> デスクトップ通知</a></h3>
<div class="outline-text-3" id="text-org08963e5">
<p>
push.jsでやればよいというが。
</p>

<p>
簡単にできた。ただ初回実行で通知が多すぎるので無視したい。
</p>

<ul class="org-ul">
<li>通知したいかどうかはクライアントによって変わる。最新のリロードしたてのクライアントでは通知は出ないが、開きっぱなしにしていたクライアントでは出る</li>
<li>初回読み込みからそれ以後に受信された場合は通知したい</li>
<li>初回リロード時は通知しない</li>
<li>最初にサーバを立ち上げたときは、徐々に追加していくので、初回リロードのロジックだけでは不足する</li>
<li>単純に更新が3分以内だったら、とかでもよさそうな</li>
</ul>
</div>
</div>
<div id="outline-container-orgc1ae89f" class="outline-3">
<h3 id="orgc1ae89f"><a href="#orgc1ae89f"><span class="done DONE">DONE</span> 上から新しい順に並ばせる</a></h3>
<div class="outline-text-3" id="text-orgc1ae89f">
<p>
今はmapから取り出してランダムで見にくい。
</p>

<p>
map型のroom.eventsで一覧を持っている。これはかぶりを防ぐためmap型にしている。eventsから、各クライアントのdoneにないものをwebsocketに書き込む。
</p>
</div>
</div>
<div id="outline-container-org2abd057" class="outline-3">
<h3 id="org2abd057"><a href="#org2abd057"><span class="done DONE">DONE</span> commentとissue openの処理を共通化する</a></h3>
<div class="outline-text-3" id="text-org2abd057">
<p>
できるところが多くある。
</p>
</div>
</div>
<div id="outline-container-org366edc6" class="outline-3">
<h3 id="org366edc6"><a href="#org366edc6"><span class="done DONE">DONE</span> eventにタイプフィールドを追加する</a></h3>
<div class="outline-text-3" id="text-org366edc6">
<p>
パッと見でわかりやすい。
</p>
<p>
タイプというか、タグ的な使い方か。
</p>
</div>
</div>
