20230610121558-garbanzo.org
** DONE 競合する
CLOSED: [2023-06-03 Sat 11:01]
:LOGBOOK:
CLOCK: [2023-06-03 Sat 10:44]--[2023-06-03 Sat 11:01] =>  0:17
CLOCK: [2023-06-03 Sat 10:18]--[2023-06-03 Sat 10:43] =>  0:25
CLOCK: [2023-06-03 Sat 09:53]--[2023-06-03 Sat 10:18] =>  0:25
:END:
まだpanicすることがある。
** DONE クライアントが増えると競合する
CLOSED: [2023-06-03 Sat 02:21]
消えたクライアントは消す。

コネクションの切断をサーバ側で見て、終了させる。切断とはつまり、websocketへの書き込みが失敗したとき。そのときハンドラのコネクションキープの無限ループを終了させ、deferで削除チャンネルに追加する、という処理。
** DONE 無限ループで通知取得する
CLOSED: [2023-06-03 Sat 02:19]
:LOGBOOK:
CLOCK: [2023-06-03 Sat 01:32]--[2023-06-03 Sat 01:57] =>  0:25
CLOCK: [2023-06-03 Sat 00:09]--[2023-06-03 Sat 00:34] =>  0:25
CLOCK: [2023-06-02 Fri 23:13]--[2023-06-02 Fri 23:38] =>  0:25
CLOCK: [2023-06-02 Fri 22:40]--[2023-06-02 Fri 23:05] =>  0:25
:END:
リアルタイムに通知を取得できるようにする。今は起動時にやってるだけ。

やるためには、無駄にリクエストしないロジックが必要になる。ストアに存在していれば、リクエストしないというような。
** DONE 無限ループでキャッシュ取得する
CLOSED: [2023-06-03 Sat 02:19]
通知取得と同様に。
** DONE 通知が少ないことがある
CLOSED: [2023-06-02 Fri 22:30]
:LOGBOOK:
CLOCK: [2023-06-02 Fri 21:35]--[2023-06-02 Fri 22:00] =>  0:25
CLOCK: [2023-06-02 Fri 21:10]--[2023-06-02 Fri 21:35] =>  0:25
CLOCK: [2023-06-02 Fri 20:45]--[2023-06-02 Fri 21:10] =>  0:25
CLOCK: [2023-06-02 Fri 20:17]--[2023-06-02 Fri 20:42] =>  0:25
:END:

競合かと思いきや、dereference失敗だ。タイトルか本文を持たないことがあるのか。
ループのどこかでreturnしているように見える。

~crypto/internal/bigmod: switch to saturated limbs~ のissueが来ると止まる。

コミットに対するコメントだと止まるのか。
** DONE 現在のURLを表示する
CLOSED: [2023-06-01 Thu 23:48]
:LOGBOOK:
CLOCK: [2023-06-01 Thu 23:31]--[2023-06-01 Thu 23:48] =>  0:17
:END:
遷移する方法もほしい。

iframeの中のURLを別タブで開けるようにする。

ボタンをリンクすればよさそう。
** DONE favicon追加する
CLOSED: [2023-06-02 Fri 01:14]
blob書き込みとしてできた。ファイルだろうとほかの、HTMLなどと同じように扱えるのに感動。
** DONE テキストをマークダウン化する
CLOSED: [2023-06-01 Thu 23:22]
:LOGBOOK:
CLOCK: [2023-06-01 Thu 23:04]--[2023-06-01 Thu 23:22] =>  0:18
:END:

ライブラリで簡単にできた。
** DONE 通知が多い場合の対応
CLOSED: [2023-06-01 Thu 22:57]
:LOGBOOK:
CLOCK: [2023-05-30 Tue 23:21]--[2023-05-30 Tue 23:46] =>  0:25
:END:
たくさんリクエストしてしまう。インメモリも無尽蔵に増えてしまう。

1リクエストで50のよう。まあいい。

- 50個を最大にして、なくなったら取得が走るようにする
  - 削除ロジックはどうするか。現状、重複を避けるためにマップにしているが、順番がないのでやりにくい

すでにあるリソースにリクエストを絶対飛ばないことがわかれば、とりあえず全部保存すればよさそう。
** DONE 通知にdiscussionがあるときにバグる
CLOSED: [2023-06-01 Thu 22:58]
subjectのURLがないよう。

スルーする処理を追加した。
** DONE 時刻表示
CLOSED: [2023-06-01 Thu 22:55]
GitHubから取ってきた時刻を入れる。
** DONE リポジトリを制限しない
CLOSED: [2023-06-01 Thu 22:32]
:LOGBOOK:
CLOCK: [2023-06-01 Thu 22:26]--[2023-06-01 Thu 22:32] =>  0:06
CLOCK: [2023-06-01 Thu 22:01]--[2023-06-01 Thu 22:26] =>  0:25
CLOCK: [2023-06-01 Thu 21:26]--[2023-06-01 Thu 21:51] =>  0:25
:END:
今はテストのため固定になっている。リポジトリ関わらず取得するようにする。ただ数がとんでもないことになりそうなので、あらかじめ数対応をしておきたい。
** DONE イメージを用意する
CLOSED: [2023-06-01 Thu 21:25]

軽量イメージを使っていい感じになった。
** DONE 初回起動時に配信されない
CLOSED: [2023-06-01 Thu 20:42]
:LOGBOOK:
CLOCK: [2023-06-01 Thu 00:59]--[2023-06-01 Thu 01:24] =>  0:25
CLOCK: [2023-06-01 Thu 00:34]--[2023-06-01 Thu 00:59] =>  0:25
:END:
起動直後に読み込むと、ウェブソケットの内容を受け取れない。clientにjoinはしているのだが、送信されてないようだ。

eventsを用意できてないと、forwardイベントが作成されないため、実行されない。起動後に無限ループ実行できれば解決する。

今のコードだと、forwardとroom.eventsを同期させようとすると全部追加で送ってしまうので、スタックしてしまう。重複もとんでもないことになる。クライアントごとに、どれが未送なのか判定できないといけない。

クライアント側にすでに送信したnotificationIDのmapを持たせておくことにした。
** DONE CPU使用率が高い
CLOSED: [2023-06-01 Thu 20:42]
:LOGBOOK:
CLOCK: [2023-06-01 Thu 20:28]--[2023-06-01 Thu 20:42] =>  0:14
CLOCK: [2023-06-01 Thu 20:03]--[2023-06-01 Thu 20:28] =>  0:25
CLOCK: [2023-06-01 Thu 19:36]--[2023-06-01 Thu 20:01] =>  0:25
:END:
送信しまくってるからな。
** DONE latest comment URL を event から消す
使ってないな。
CLOSED: [2023-05-30 Tue 23:19]
** DONE サイドバーの固定
CLOSED: [2023-05-30 Tue 22:52]
通知がたくさんあるとページが下に伸びる。
** DONE コメント種別によってエラーになる
CLOSED: [2023-05-30 Tue 22:52]
まだ特定してない。

issueが開かれたときの通知だな。
** DONE event内にリポジトリ情報を入れる
CLOSED: [2023-05-30 Tue 20:39]
リポジトリ名を入れる。
** DONE プロキシを図に描く
CLOSED: [2023-06-11 Sun 14:06]
頭がこんがらがるので整理する。
** DONE ステータスを表示するページ
CLOSED: [2023-06-12 Mon 01:09]
:PROPERTIES:
:Effort:   5:00
:END:
:LOGBOOK:
CLOCK: [2023-06-11 Sun 23:23]--[2023-06-11 Sun 23:48] =>  0:25
CLOCK: [2023-06-11 Sun 22:58]--[2023-06-11 Sun 23:23] =>  0:25
CLOCK: [2023-06-11 Sun 22:33]--[2023-06-11 Sun 22:58] =>  0:25
CLOCK: [2023-06-11 Sun 22:07]--[2023-06-11 Sun 22:32] =>  0:25
CLOCK: [2023-06-11 Sun 21:42]--[2023-06-11 Sun 22:07] =>  0:25
CLOCK: [2023-06-11 Sun 21:16]--[2023-06-11 Sun 21:41] =>  0:25
CLOCK: [2023-06-11 Sun 20:51]--[2023-06-11 Sun 21:16] =>  0:25
CLOCK: [2023-06-11 Sun 20:21]--[2023-06-11 Sun 20:46] =>  0:25
CLOCK: [2023-06-11 Sun 19:19]--[2023-06-11 Sun 19:44] =>  0:25
CLOCK: [2023-06-11 Sun 18:48]--[2023-06-11 Sun 19:13] =>  0:25
CLOCK: [2023-06-11 Sun 18:17]--[2023-06-11 Sun 18:42] =>  0:25
CLOCK: [2023-06-11 Sun 17:28]--[2023-06-11 Sun 17:53] =>  0:25
CLOCK: [2023-06-11 Sun 17:01]--[2023-06-11 Sun 17:26] =>  0:25
CLOCK: [2023-06-11 Sun 16:09]--[2023-06-11 Sun 16:34] =>  0:25
CLOCK: [2023-06-11 Sun 15:43]--[2023-06-11 Sun 16:08] =>  0:25
CLOCK: [2023-06-11 Sun 15:08]--[2023-06-11 Sun 15:33] =>  0:25
CLOCK: [2023-06-11 Sun 14:41]--[2023-06-11 Sun 15:06] =>  0:25
:END:
どこまでフェッチが終わったかを示す。

今はwebsocketでeventしか送ってないが、別の情報を送るのはどうするか。

- 送信すると止まるな。受信元が用意できてないとか。
  - 同じゴルーチン上で送信と受信してるから、capが1以上でないとブロックして止まるようになっていた
- 今はsendにあるごとに、jsonにwriteしてる。すでにある場合は無視してる。
- イベントを送るときと、統計を送るときは明らかに、タイミングと送るjsonが異なる
  - 今はjsonが同じなのが問題だ。event用しか送れない
  - websocketごと分けるとコードの重複が増えるのと、接続を管理する手間が増える
- case文にdefaultがないと、ループして先に進まない
- 2回読み込みできなくなった
** DONE プロキシをGitHub以外に対応する
CLOSED: [2023-06-15 Thu 00:27]
:LOGBOOK:
CLOCK: [2023-06-11 Sun 14:07]--[2023-06-11 Sun 14:32] =>  0:25
:END:

ホストが何でもできるようにする。できたが、相変わらずその画面から別のリンクを開くことはできない。

** DONE たまに何も出なくなる
CLOSED: [2023-06-15 Thu 00:26]
- 統計の数字がすべて0になる
- エラーとかは出てない

ロック関係か。途中でなることもある。その場合は既読が増えない。メインのselect文が止まるってことか。既読ボタンを連打するとなるぽい。時間のかかるリクエストを非同期にした。
** DONE RSSを既読記録できるようにする
CLOSED: [2023-06-18 Sun 10:23]
:PROPERTIES:
:Effort:   3:00
:END:
:LOGBOOK:
CLOCK: [2023-06-18 Sun 09:57]--[2023-06-18 Sun 10:22] =>  0:25
CLOCK: [2023-06-18 Sun 09:32]--[2023-06-18 Sun 09:57] =>  0:25
CLOCK: [2023-06-17 Sat 20:40]--[2023-06-17 Sat 21:05] =>  0:25
CLOCK: [2023-06-17 Sat 20:04]--[2023-06-17 Sat 20:29] =>  0:25
CLOCK: [2023-06-17 Sat 17:55]--[2023-06-17 Sat 18:20] =>  0:25
CLOCK: [2023-06-17 Sat 17:30]--[2023-06-17 Sat 17:55] =>  0:25
CLOCK: [2023-06-17 Sat 16:22]--[2023-06-17 Sat 16:47] =>  0:25
CLOCK: [2023-06-17 Sat 13:40]--[2023-06-17 Sat 14:05] =>  0:25
CLOCK: [2023-06-17 Sat 13:12]--[2023-06-17 Sat 13:37] =>  0:25
CLOCK: [2023-06-17 Sat 12:15]--[2023-06-17 Sat 12:40] =>  0:25
CLOCK: [2023-06-17 Sat 11:49]--[2023-06-17 Sat 12:15] =>  0:26
CLOCK: [2023-06-17 Sat 11:12]--[2023-06-17 Sat 11:37] =>  0:25
CLOCK: [2023-06-17 Sat 10:31]--[2023-06-17 Sat 10:56] =>  0:25
CLOCK: [2023-06-17 Sat 09:46]--[2023-06-17 Sat 10:11] =>  0:25
CLOCK: [2023-06-17 Sat 09:21]--[2023-06-17 Sat 09:46] =>  0:25
:END:

既読の場合は非表示にしたい。

- 既読をどうやって記録するか
  - CSVファイルに保存する
  - 既読したときにリンクを書き込む
  - 読み込むときにリンクリストを見て、ないときにeventに追加する
- 設定ディレクトリを生成する(.garbanzo)
- ファイルを生成する(history)
- 読み込まないパターン
  - ファイルにあるとき
  - メモリにあるとき
** DONE RSS対応する
CLOSED: [2023-06-18 Sun 10:04]
:LOGBOOK:
CLOCK: [2023-06-14 Wed 23:10]--[2023-06-14 Wed 23:35] =>  0:25
CLOCK: [2023-06-14 Wed 22:43]--[2023-06-14 Wed 23:08] =>  0:25
CLOCK: [2023-06-14 Wed 21:53]--[2023-06-14 Wed 22:18] =>  0:25
CLOCK: [2023-06-14 Wed 21:17]--[2023-06-14 Wed 21:43] =>  0:26
CLOCK: [2023-06-14 Wed 20:40]--[2023-06-14 Wed 21:05] =>  0:25
CLOCK: [2023-06-14 Wed 20:15]--[2023-06-14 Wed 20:40] =>  0:25
CLOCK: [2023-06-11 Sun 13:41]--[2023-06-11 Sun 14:06] =>  0:25
:END:

いちおう表示はできるようになった。
