20230610121558-garbanzo.html
<div id="outline-container-orgc6fb263" class="outline-3">
<h3 id="orgc6fb263"><a href="#orgc6fb263"><span class="done DONE">DONE</span> 競合する</a></h3>
<div class="outline-text-3" id="text-orgc6fb263">
<p>
まだpanicすることがある。
</p>
</div>
</div>
<div id="outline-container-orga7f0eb8" class="outline-3">
<h3 id="orga7f0eb8"><a href="#orga7f0eb8"><span class="done DONE">DONE</span> クライアントが増えると競合する</a></h3>
<div class="outline-text-3" id="text-orga7f0eb8">
<p>
消えたクライアントは消す。
</p>

<p>
コネクションの切断をサーバ側で見て、終了させる。切断とはつまり、websocketへの書き込みが失敗したとき。そのときハンドラのコネクションキープの無限ループを終了させ、deferで削除チャンネルに追加する、という処理。
</p>
</div>
</div>
<div id="outline-container-orgfa662b8" class="outline-3">
<h3 id="orgfa662b8"><a href="#orgfa662b8"><span class="done DONE">DONE</span> 無限ループで通知取得する</a></h3>
<div class="outline-text-3" id="text-orgfa662b8">
<p>
リアルタイムに通知を取得できるようにする。今は起動時にやってるだけ。
</p>

<p>
やるためには、無駄にリクエストしないロジックが必要になる。ストアに存在していれば、リクエストしないというような。
</p>
</div>
</div>
<div id="outline-container-org48f7410" class="outline-3">
<h3 id="org48f7410"><a href="#org48f7410"><span class="done DONE">DONE</span> 無限ループでキャッシュ取得する</a></h3>
<div class="outline-text-3" id="text-org48f7410">
<p>
通知取得と同様に。
</p>
</div>
</div>
<div id="outline-container-org5d736ac" class="outline-3">
<h3 id="org5d736ac"><a href="#org5d736ac"><span class="done DONE">DONE</span> 通知が少ないことがある</a></h3>
<div class="outline-text-3" id="text-org5d736ac">
<p>
競合かと思いきや、dereference失敗だ。タイトルか本文を持たないことがあるのか。
ループのどこかでreturnしているように見える。
</p>

<p>
<code>crypto/internal/bigmod: switch to saturated limbs</code> のissueが来ると止まる。
</p>

<p>
コミットに対するコメントだと止まるのか。
</p>
</div>
</div>
<div id="outline-container-org1d67ad0" class="outline-3">
<h3 id="org1d67ad0"><a href="#org1d67ad0"><span class="done DONE">DONE</span> 現在のURLを表示する</a></h3>
<div class="outline-text-3" id="text-org1d67ad0">
<p>
遷移する方法もほしい。
</p>

<p>
iframeの中のURLを別タブで開けるようにする。
</p>

<p>
ボタンをリンクすればよさそう。
</p>
</div>
</div>
<div id="outline-container-org202e442" class="outline-3">
<h3 id="org202e442"><a href="#org202e442"><span class="done DONE">DONE</span> favicon追加する</a></h3>
<div class="outline-text-3" id="text-org202e442">
<p>
blob書き込みとしてできた。ファイルだろうとほかの、HTMLなどと同じように扱えるのに感動。
</p>
</div>
</div>
<div id="outline-container-org83ef5a4" class="outline-3">
<h3 id="org83ef5a4"><a href="#org83ef5a4"><span class="done DONE">DONE</span> テキストをマークダウン化する</a></h3>
<div class="outline-text-3" id="text-org83ef5a4">
<p>
ライブラリで簡単にできた。
</p>
</div>
</div>
<div id="outline-container-orga1a8e29" class="outline-3">
<h3 id="orga1a8e29"><a href="#orga1a8e29"><span class="done DONE">DONE</span> 通知が多い場合の対応</a></h3>
<div class="outline-text-3" id="text-orga1a8e29">
<p>
たくさんリクエストしてしまう。インメモリも無尽蔵に増えてしまう。
</p>

<p>
1リクエストで50のよう。まあいい。
</p>

<ul class="org-ul">
<li>50個を最大にして、なくなったら取得が走るようにする
<ul class="org-ul">
<li>削除ロジックはどうするか。現状、重複を避けるためにマップにしているが、順番がないのでやりにくい</li>
</ul></li>
</ul>

<p>
すでにあるリソースにリクエストを絶対飛ばないことがわかれば、とりあえず全部保存すればよさそう。
</p>
</div>
</div>
<div id="outline-container-orgbc032cb" class="outline-3">
<h3 id="orgbc032cb"><a href="#orgbc032cb"><span class="done DONE">DONE</span> 通知にdiscussionがあるときにバグる</a></h3>
<div class="outline-text-3" id="text-orgbc032cb">
<p>
subjectのURLがないよう。
</p>

<p>
スルーする処理を追加した。
</p>
</div>
</div>
<div id="outline-container-orgaa61c63" class="outline-3">
<h3 id="orgaa61c63"><a href="#orgaa61c63"><span class="done DONE">DONE</span> 時刻表示</a></h3>
<div class="outline-text-3" id="text-orgaa61c63">
<p>
GitHubから取ってきた時刻を入れる。
</p>
</div>
</div>
<div id="outline-container-orgbc150cd" class="outline-3">
<h3 id="orgbc150cd"><a href="#orgbc150cd"><span class="done DONE">DONE</span> リポジトリを制限しない</a></h3>
<div class="outline-text-3" id="text-orgbc150cd">
<p>
今はテストのため固定になっている。リポジトリ関わらず取得するようにする。ただ数がとんでもないことになりそうなので、あらかじめ数対応をしておきたい。
</p>
</div>
</div>
<div id="outline-container-orgc7090cf" class="outline-3">
<h3 id="orgc7090cf"><a href="#orgc7090cf"><span class="done DONE">DONE</span> イメージを用意する</a></h3>
<div class="outline-text-3" id="text-orgc7090cf">
<p>
軽量イメージを使っていい感じになった。
</p>
</div>
</div>
<div id="outline-container-org03c99cd" class="outline-3">
<h3 id="org03c99cd"><a href="#org03c99cd"><span class="done DONE">DONE</span> 初回起動時に配信されない</a></h3>
<div class="outline-text-3" id="text-org03c99cd">
<p>
起動直後に読み込むと、ウェブソケットの内容を受け取れない。clientにjoinはしているのだが、送信されてないようだ。
</p>

<p>
eventsを用意できてないと、forwardイベントが作成されないため、実行されない。起動後に無限ループ実行できれば解決する。
</p>

<p>
今のコードだと、forwardとroom.eventsを同期させようとすると全部追加で送ってしまうので、スタックしてしまう。重複もとんでもないことになる。クライアントごとに、どれが未送なのか判定できないといけない。
</p>

<p>
クライアント側にすでに送信したnotificationIDのmapを持たせておくことにした。
</p>
</div>
</div>
<div id="outline-container-org6f3ac82" class="outline-3">
<h3 id="org6f3ac82"><a href="#org6f3ac82"><span class="done DONE">DONE</span> CPU使用率が高い</a></h3>
<div class="outline-text-3" id="text-org6f3ac82">
<p>
送信しまくってるからな。
</p>
</div>
</div>
<div id="outline-container-org998e83b" class="outline-3">
<h3 id="org998e83b"><a href="#org998e83b"><span class="done DONE">DONE</span> latest comment URL を event から消す</a></h3>
<div class="outline-text-3" id="text-org998e83b">
<p>
使ってないな。
CLOSED: <span class="timestamp-wrapper"><span class="timestamp">[2023-05-30 火 23:19]</span></span>
</p>
</div>
</div>
<div id="outline-container-org3694fec" class="outline-3">
<h3 id="org3694fec"><a href="#org3694fec"><span class="done DONE">DONE</span> サイドバーの固定</a></h3>
<div class="outline-text-3" id="text-org3694fec">
<p>
通知がたくさんあるとページが下に伸びる。
</p>
</div>
</div>
<div id="outline-container-orgcd88e66" class="outline-3">
<h3 id="orgcd88e66"><a href="#orgcd88e66"><span class="done DONE">DONE</span> コメント種別によってエラーになる</a></h3>
<div class="outline-text-3" id="text-orgcd88e66">
<p>
まだ特定してない。
</p>

<p>
issueが開かれたときの通知だな。
</p>
</div>
</div>
<div id="outline-container-orgd02771c" class="outline-3">
<h3 id="orgd02771c"><a href="#orgd02771c"><span class="done DONE">DONE</span> event内にリポジトリ情報を入れる</a></h3>
<div class="outline-text-3" id="text-orgd02771c">
<p>
リポジトリ名を入れる。
</p>
</div>
</div>
<div id="outline-container-orgb63508f" class="outline-3">
<h3 id="orgb63508f"><a href="#orgb63508f"><span class="done DONE">DONE</span> プロキシを図に描く</a></h3>
<div class="outline-text-3" id="text-orgb63508f">
<p>
頭がこんがらがるので整理する。
</p>
</div>
</div>
<div id="outline-container-org3db90e4" class="outline-3">
<h3 id="org3db90e4"><a href="#org3db90e4"><span class="done DONE">DONE</span> ステータスを表示するページ</a></h3>
<div class="outline-text-3" id="text-org3db90e4">
<p>
どこまでフェッチが終わったかを示す。
</p>

<p>
今はwebsocketでeventしか送ってないが、別の情報を送るのはどうするか。
</p>

<ul class="org-ul">
<li>送信すると止まるな。受信元が用意できてないとか。
<ul class="org-ul">
<li>同じゴルーチン上で送信と受信してるから、capが1以上でないとブロックして止まるようになっていた</li>
</ul></li>
<li>今はsendにあるごとに、jsonにwriteしてる。すでにある場合は無視してる。</li>
<li>イベントを送るときと、統計を送るときは明らかに、タイミングと送るjsonが異なる
<ul class="org-ul">
<li>今はjsonが同じなのが問題だ。event用しか送れない</li>
<li>websocketごと分けるとコードの重複が増えるのと、接続を管理する手間が増える</li>
</ul></li>
<li>case文にdefaultがないと、ループして先に進まない</li>
<li>2回読み込みできなくなった</li>
</ul>
</div>
</div>
<div id="outline-container-org220a041" class="outline-3">
<h3 id="org220a041"><a href="#org220a041"><span class="done DONE">DONE</span> プロキシをGitHub以外に対応する</a></h3>
<div class="outline-text-3" id="text-org220a041">
<p>
ホストが何でもできるようにする。できたが、相変わらずその画面から別のリンクを開くことはできない。
</p>
</div>
</div>

<div id="outline-container-org509c3ee" class="outline-3">
<h3 id="org509c3ee"><a href="#org509c3ee"><span class="done DONE">DONE</span> たまに何も出なくなる</a></h3>
<div class="outline-text-3" id="text-org509c3ee">
<ul class="org-ul">
<li>統計の数字がすべて0になる</li>
<li>エラーとかは出てない</li>
</ul>

<p>
ロック関係か。途中でなることもある。その場合は既読が増えない。メインのselect文が止まるってことか。既読ボタンを連打するとなるぽい。時間のかかるリクエストを非同期にした。
</p>
</div>
</div>
<div id="outline-container-org6a27440" class="outline-3">
<h3 id="org6a27440"><a href="#org6a27440"><span class="done DONE">DONE</span> RSSを既読記録できるようにする</a></h3>
<div class="outline-text-3" id="text-org6a27440">
<p>
既読の場合は非表示にしたい。
</p>

<ul class="org-ul">
<li>既読をどうやって記録するか
<ul class="org-ul">
<li>CSVファイルに保存する</li>
<li>既読したときにリンクを書き込む</li>
<li>読み込むときにリンクリストを見て、ないときにeventに追加する</li>
</ul></li>
<li>設定ディレクトリを生成する(.garbanzo)</li>
<li>ファイルを生成する(history)</li>
<li>読み込まないパターン
<ul class="org-ul">
<li>ファイルにあるとき</li>
<li>メモリにあるとき</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgaa34dcf" class="outline-3">
<h3 id="orgaa34dcf"><a href="#orgaa34dcf"><span class="done DONE">DONE</span> RSS対応する</a></h3>
<div class="outline-text-3" id="text-orgaa34dcf">
<p>
いちおう表示はできるようになった。
</p>
</div>
</div>
