20230610121558-garbanzo.org
** DONE フィードURLを設定ファイルから取り込むようにする
CLOSED: [2023-06-18 Sun 10:04]
先に既読対応しないと、取りまくってしまう。
** DONE フィード設定ファイルがない場合の対応
CLOSED: [2023-06-18 Sun 11:47]
:LOGBOOK:
CLOCK: [2023-06-18 Sun 11:22]--[2023-06-18 Sun 11:47] =>  0:25
:END:
ファイルがない場合は作成する。起動したときに、いくつかのファイルについて作成を走らせる。
** DONE フィード表示を整える
CLOSED: [2023-06-18 Sun 11:21]
:LOGBOOK:
CLOCK: [2023-06-18 Sun 10:51]--[2023-06-18 Sun 11:16] =>  0:25
CLOCK: [2023-06-18 Sun 10:23]--[2023-06-18 Sun 10:49] =>  0:26
:END:
- アイコン
- リンク
- 作成日時

などを入れる。
** DONE 統計表示を表にする
CLOSED: [2023-06-18 Sun 18:40]
:LOGBOOK:
CLOCK: [2023-06-18 Sun 18:02]--[2023-06-18 Sun 18:27] =>  0:25
:END:
もうちょっときれいに表示する。
** DONE RSSのdescriptionにHTMLタグが入っているので消す
CLOSED: [2023-06-18 Sun 18:40]
文字を切り取るので、HTMLタグにしてるとうまくいかない。
** DONE 設定ファイルのテンプレートを用意する
CLOSED: [2023-06-20 Tue 01:14]
空白のファイルができるだけでわかりづらい。
** DONE フィードのドキュメントを作成する
CLOSED: [2023-06-20 Tue 01:14]
:PROPERTIES:
:Effort:   3:00
:END:
:LOGBOOK:
CLOCK: [2023-06-20 Tue 00:17]--[2023-06-20 Tue 00:42] =>  0:25
CLOCK: [2023-06-19 Mon 23:45]--[2023-06-20 Tue 00:10] =>  0:25
CLOCK: [2023-06-19 Mon 23:19]--[2023-06-19 Mon 23:44] =>  0:25
CLOCK: [2023-06-19 Mon 22:47]--[2023-06-19 Mon 23:12] =>  0:25
CLOCK: [2023-06-19 Mon 22:10]--[2023-06-19 Mon 22:35] =>  0:25
:END:
書く。

- 設定ymlのエントリの例を作成する
- 今の設定をトップページに表示する
- ないときは自動作成する
** DONE ymlのタイトルを何かに使う
CLOSED: [2023-06-20 Tue 01:15]
あるいは設定ファイルからタイトルを消す。今はイベントと分離して使えない。できればカテゴリにしたいが…。

フィードリストの説明を表示するために、増やした。タイトルではなくdescriptionとした。
** DONE RSSの取得情報をいい感じにする
CLOSED: [2023-06-20 Tue 01:16]
アイコンがブランクになることが多い。どうにかできないか。

とりあえず一括でRSSアイコンにした。
** CLOSE 起動直後にリロードするとクライアントの分だけfetchが走るような
CLOSED: [2023-06-20 Tue 01:16]
ログを仕込んだときに2つ出てくるときがある。
** CLOSE トークンをトップページから入れられるようにする
CLOSED: [2023-07-01 Sat 02:32]
別にファイルを直にいじってできればいいので、スルー。

入れて、設定ファイルに保存して次回以降使う。iframe内でやると、POSTできない可能性がある。
** DONE トークンを設定ファイルから読み込めるようにする
CLOSED: [2023-07-01 Sat 02:32]
:LOGBOOK:
CLOCK: [2023-07-01 Sat 01:48]--[2023-07-01 Sat 02:13] =>  0:25
CLOCK: [2023-07-01 Sat 01:12]--[2023-07-01 Sat 01:37] =>  0:25
CLOCK: [2023-07-01 Sat 00:47]--[2023-07-01 Sat 01:12] =>  0:25
CLOCK: [2023-07-01 Sat 00:16]--[2023-07-01 Sat 00:41] =>  0:25
CLOCK: [2023-06-30 Fri 23:50]--[2023-07-01 Sat 00:15] =>  0:25
CLOCK: [2023-06-30 Fri 23:25]--[2023-06-30 Fri 23:50] =>  0:25
CLOCK: [2023-06-30 Fri 23:00]--[2023-06-30 Fri 23:25] =>  0:25
CLOCK: [2023-06-30 Fri 22:25]--[2023-06-30 Fri 22:50] =>  0:25
CLOCK: [2023-06-30 Fri 21:35]--[2023-06-30 Fri 22:00] =>  0:25
CLOCK: [2023-06-30 Fri 00:05]--[2023-06-30 Fri 00:30] =>  0:25
CLOCK: [2023-06-29 Thu 23:40]--[2023-06-30 Fri 00:05] =>  0:25
CLOCK: [2023-06-29 Thu 23:15]--[2023-06-29 Thu 23:40] =>  0:25
:END:
環境変数では面倒だ。
** DONE 構造体まわりのリファクタ
CLOSED: [2023-07-01 Sat 11:23]
:PROPERTIES:
:Effort:   2:00
:END:
:LOGBOOK:
CLOCK: [2023-07-01 Sat 10:53]--[2023-07-01 Sat 11:18] =>  0:25
CLOCK: [2023-07-01 Sat 10:28]--[2023-07-01 Sat 10:53] =>  0:25
CLOCK: [2023-07-01 Sat 10:03]--[2023-07-01 Sat 10:28] =>  0:25
CLOCK: [2023-07-01 Sat 09:38]--[2023-07-01 Sat 10:03] =>  0:25
CLOCK: [2023-07-01 Sat 09:00]--[2023-07-01 Sat 09:25] =>  0:25
CLOCK: [2023-07-01 Sat 08:35]--[2023-07-01 Sat 09:00] =>  0:25
CLOCK: [2023-07-01 Sat 08:09]--[2023-07-01 Sat 08:34] =>  0:25
:END:

- 場所がわかりづらい
- 関数がでかい
- 設定がまとまってない
** DONE テンプレートに構造体を渡す
CLOSED: [2023-07-01 Sat 14:54]
:PROPERTIES:
:Effort:   2:00
:END:
:LOGBOOK:
CLOCK: [2023-07-01 Sat 12:39]--[2023-07-01 Sat 13:04] =>  0:25
CLOCK: [2023-07-01 Sat 11:23]--[2023-07-01 Sat 11:48] =>  0:25
:END:
** DONE 定数化する
CLOSED: [2023-07-01 Sat 14:54]
:LOGBOOK:
CLOCK: [2023-06-20 Tue 22:58]--[2023-06-20 Tue 23:23] =>  0:25
:END:
リファクタ。
** DONE トークンがないとき実行すると止まる
CLOSED: [2023-07-01 Sat 22:06]
:LOGBOOK:
CLOCK: [2023-07-01 Sat 21:32]--[2023-07-01 Sat 21:57] =>  0:25
CLOCK: [2023-07-01 Sat 20:57]--[2023-07-01 Sat 21:22] =>  0:25
:END:
いつのまにか。

トークンがないときか。
** DONE brew installに対応する
CLOSED: [2023-07-02 Sun 01:26]
:LOGBOOK:
CLOCK: [2023-07-02 Sun 00:11]--[2023-07-02 Sun 00:36] =>  0:25
CLOCK: [2023-07-01 Sat 23:00]--[2023-07-01 Sat 23:25] =>  0:25
CLOCK: [2023-07-01 Sat 22:35]--[2023-07-01 Sat 23:00] =>  0:25
CLOCK: [2023-07-01 Sat 22:07]--[2023-07-01 Sat 22:32] =>  0:25
:END:
気軽にMacでもインストールできるようにする。

- Go installはGoが入っているか限らない
- dockerは使い方に慣れてない可能性がある

動作確認するのが面倒だな。
