20230610121558-garbanzo.html
<div id="outline-container-org543260d" class="outline-3">
<h3 id="org543260d"><a href="#org543260d"><span class="done DONE">DONE</span> フィードURLを設定ファイルから取り込むようにする</a></h3>
<div class="outline-text-3" id="text-org543260d">
<p>
先に既読対応しないと、取りまくってしまう。
</p>
</div>
</div>
<div id="outline-container-orga40ba20" class="outline-3">
<h3 id="orga40ba20"><a href="#orga40ba20"><span class="done DONE">DONE</span> フィード設定ファイルがない場合の対応</a></h3>
<div class="outline-text-3" id="text-orga40ba20">
<p>
ファイルがない場合は作成する。起動したときに、いくつかのファイルについて作成を走らせる。
</p>
</div>
</div>
<div id="outline-container-org62f8ee0" class="outline-3">
<h3 id="org62f8ee0"><a href="#org62f8ee0"><span class="done DONE">DONE</span> フィード表示を整える</a></h3>
<div class="outline-text-3" id="text-org62f8ee0">
<ul class="org-ul">
<li>アイコン</li>
<li>リンク</li>
<li>作成日時</li>
</ul>

<p>
などを入れる。
</p>
</div>
</div>
<div id="outline-container-orgcb5e358" class="outline-3">
<h3 id="orgcb5e358"><a href="#orgcb5e358"><span class="done DONE">DONE</span> 統計表示を表にする</a></h3>
<div class="outline-text-3" id="text-orgcb5e358">
<p>
もうちょっときれいに表示する。
</p>
</div>
</div>
<div id="outline-container-org5df5ffd" class="outline-3">
<h3 id="org5df5ffd"><a href="#org5df5ffd"><span class="done DONE">DONE</span> RSSのdescriptionにHTMLタグが入っているので消す</a></h3>
<div class="outline-text-3" id="text-org5df5ffd">
<p>
文字を切り取るので、HTMLタグにしてるとうまくいかない。
</p>
</div>
</div>
<div id="outline-container-orgf1888db" class="outline-3">
<h3 id="orgf1888db"><a href="#orgf1888db"><span class="done DONE">DONE</span> 設定ファイルのテンプレートを用意する</a></h3>
<div class="outline-text-3" id="text-orgf1888db">
<p>
空白のファイルができるだけでわかりづらい。
</p>
</div>
</div>
<div id="outline-container-orgd385cdf" class="outline-3">
<h3 id="orgd385cdf"><a href="#orgd385cdf"><span class="done DONE">DONE</span> フィードのドキュメントを作成する</a></h3>
<div class="outline-text-3" id="text-orgd385cdf">
<p>
書く。
</p>

<ul class="org-ul">
<li>設定ymlのエントリの例を作成する</li>
<li>今の設定をトップページに表示する</li>
<li>ないときは自動作成する</li>
</ul>
</div>
</div>
<div id="outline-container-org4e99f31" class="outline-3">
<h3 id="org4e99f31"><a href="#org4e99f31"><span class="done DONE">DONE</span> ymlのタイトルを何かに使う</a></h3>
<div class="outline-text-3" id="text-org4e99f31">
<p>
あるいは設定ファイルからタイトルを消す。今はイベントと分離して使えない。できればカテゴリにしたいが…。
</p>

<p>
フィードリストの説明を表示するために、増やした。タイトルではなくdescriptionとした。
</p>
</div>
</div>
<div id="outline-container-org96c53fd" class="outline-3">
<h3 id="org96c53fd"><a href="#org96c53fd"><span class="done DONE">DONE</span> RSSの取得情報をいい感じにする</a></h3>
<div class="outline-text-3" id="text-org96c53fd">
<p>
アイコンがブランクになることが多い。どうにかできないか。
</p>

<p>
とりあえず一括でRSSアイコンにした。
</p>
</div>
</div>
<div id="outline-container-org944b404" class="outline-3">
<h3 id="org944b404"><a href="#org944b404"><span class="done CLOSE">CLOSE</span> 起動直後にリロードするとクライアントの分だけfetchが走るような</a></h3>
<div class="outline-text-3" id="text-org944b404">
<p>
ログを仕込んだときに2つ出てくるときがある。
</p>
</div>
</div>
<div id="outline-container-org32147a4" class="outline-3">
<h3 id="org32147a4"><a href="#org32147a4"><span class="done CLOSE">CLOSE</span> トークンをトップページから入れられるようにする</a></h3>
<div class="outline-text-3" id="text-org32147a4">
<p>
別にファイルを直にいじってできればいいので、スルー。
</p>

<p>
入れて、設定ファイルに保存して次回以降使う。iframe内でやると、POSTできない可能性がある。
</p>
</div>
</div>
<div id="outline-container-org8644da8" class="outline-3">
<h3 id="org8644da8"><a href="#org8644da8"><span class="done DONE">DONE</span> トークンを設定ファイルから読み込めるようにする</a></h3>
<div class="outline-text-3" id="text-org8644da8">
<p>
環境変数では面倒だ。
</p>
</div>
</div>
<div id="outline-container-orgb69718e" class="outline-3">
<h3 id="orgb69718e"><a href="#orgb69718e"><span class="done DONE">DONE</span> 構造体まわりのリファクタ</a></h3>
<div class="outline-text-3" id="text-orgb69718e">
<ul class="org-ul">
<li>場所がわかりづらい</li>
<li>関数がでかい</li>
<li>設定がまとまってない</li>
</ul>
</div>
</div>
<div id="outline-container-org4d312c7" class="outline-3">
<h3 id="org4d312c7"><a href="#org4d312c7"><span class="done DONE">DONE</span> テンプレートに構造体を渡す</a></h3>
<div class="outline-text-3" id="text-org4d312c7">
</div>
</div>
<div id="outline-container-orgc3dc95b" class="outline-3">
<h3 id="orgc3dc95b"><a href="#orgc3dc95b"><span class="done DONE">DONE</span> 定数化する</a></h3>
<div class="outline-text-3" id="text-orgc3dc95b">
<p>
リファクタ。
</p>
</div>
</div>
<div id="outline-container-orgdeb3bc2" class="outline-3">
<h3 id="orgdeb3bc2"><a href="#orgdeb3bc2"><span class="done DONE">DONE</span> トークンがないとき実行すると止まる</a></h3>
<div class="outline-text-3" id="text-orgdeb3bc2">
<p>
いつのまにか。
</p>

<p>
トークンがないときか。
</p>
</div>
</div>
<div id="outline-container-org575686d" class="outline-3">
<h3 id="org575686d"><a href="#org575686d"><span class="done DONE">DONE</span> brew installに対応する</a></h3>
<div class="outline-text-3" id="text-org575686d">
<p>
気軽にMacでもインストールできるようにする。
</p>

<ul class="org-ul">
<li>Go installはGoが入っているか限らない</li>
<li>dockerは使い方に慣れてない可能性がある</li>
</ul>

<p>
動作確認するのが面倒だな。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
